Revit 2026 API

# IDropHandler Methods

---

The IDropHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to handle the drop event for your data. |

#### Reference

IDropHandler Interface

Autodesk.Revit.UI Namespace